{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function_type": "lambda", "batch_input_shape": [null, 20, 80, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "output_shape": [20, 80, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 8, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_1", "nb_row": 5, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_2", "nb_row": 5, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_3", "nb_row": 5, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_4", "nb_row": 3, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_5", "nb_row": 3, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 16384, "b_regularizer": null, "activation": "linear", "name": "dense_1", "output_dim": 64, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 16384], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"input_dim": 64, "b_regularizer": null, "activation": "linear", "name": "dense_2", "output_dim": 32, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 64], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"input_dim": 32, "b_regularizer": null, "activation": "linear", "name": "dense_3", "output_dim": 16, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 32], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_8"}}, {"class_name": "Dense", "config": {"input_dim": 16, "b_regularizer": null, "activation": "linear", "name": "dense_4", "output_dim": 1, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 16], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}]}